In [34]:
import pandas as pd
pd.set_option('display.max_column',10)

In [35]:
df=pd.read_excel("marksheet EEE.xlsx")
print(df)

   Unnamed: 0.4  Unnamed: 0.3  Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  ...  \
0             0             0             0             0           0  ...
1             1             1             1             1           1  ...
2             2             2             2             2           2  ...
3             3             3             3             3           3  ...
4             4             4             4             4           4  ...
5             5             5             5             5           5  ...
6             6             6             6             6           6  ...
7             7             7             7             7           7  ...
8             8             8             8             8           8  ...
9             9             9             9             9           9  ...

   Eng  Maths Science  Social  Total
0   80     90      69      55    358
1   98     55      92      76    374
2   98     55      94      76    374
3   84     90      94      64    374
4   84     90      94      64    374
5   90     56      70      83    374
6   90     56      99      83    374
7   66     77      99      62    374
8   91     77      94      62    374
9   83     59      94      55    374

[10 rows x 13 columns]

In [36]:
k=df.fillna(method='pad')
print(k)
print("\n updated line \n")
k.to_excel("marksheet EEE.xlsx")

   Unnamed: 0.4  Unnamed: 0.3  Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  ...  \
0             0             0             0             0           0  ...
1             1             1             1             1           1  ...
2             2             2             2             2           2  ...
3             3             3             3             3           3  ...
4             4             4             4             4           4  ...
5             5             5             5             5           5  ...
6             6             6             6             6           6  ...
7             7             7             7             7           7  ...
8             8             8             8             8           8  ...
9             9             9             9             9           9  ...

   Eng  Maths Science  Social  Total
0   80     90      69      55    358
1   98     55      92      76    374
2   98     55      94      76    374
3   84     90      94      64    374
4   84     90      94      64    374
5   90     56      70      83    374
6   90     56      99      83    374
7   66     77      99      62    374
8   91     77      94      62    374
9   83     59      94      55    374

[10 rows x 13 columns]

 updated line

/var/folders/1n/gl1krczj1y58m5tm4xz0t6740000gp/T/ipykernel_1113/1261798097.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  k=df.fillna(method='pad')

In [37]:
k.drop(['Eng'],axis=1,inplace=True)

print(k)
k.to_excel("marksheet EEE.xlsx")

   Unnamed: 0.4  Unnamed: 0.3  Unnamed: 0.1  Unnamed: 0  S.no  ...     Name   \
0             0             0             0           0     1  ...      Bala
1             1             1             1           1     2  ...    Balaji
2             2             2             2           2     3  ...    Barath
3             3             3             3           3     4  ...   Bharath
4             4             4             4           4     5  ...    Bhavan
5             5             5             5           5     6  ...    Bhavya
6             6             6             6           6     7  ...   Chandra
7             7             7             7           7     8  ...  Chelliah
8             8             8             8           8     9  ...   Deepika
9             9             9             9           9    10  ...     Diana

  Maths  Science  Social  Total
0    90       69      55    358
1    55       92      76    374
2    55       94      76    374
3    90       94      64    374
4    90       94      64    374
5    56       70      83    374
6    56       99      83    374
7    77       99      62    374
8    77       94      62    374
9    59       94      55    374

[10 rows x 11 columns]

In [38]:
print("\n Drop Nan row \n")
df=pd.read_excel("marksheet EEE1.xlsx")
print(df)
x=df.dropna()
print(x)
x.to_excel("marksheet EEE1.xlsx")

 Drop Nan row

   Unnamed: 0.1  Unnamed: 0  S.no  Roll number   Name   ...  Tamil  Maths  \
0             0           0     1           10    Bala  ...     65     89
1             1           1     2           11  Balaji  ...     53     55

   Science  Social  Total
0       69      55    358
1       92      76    374

[2 rows x 11 columns]
   Unnamed: 0.1  Unnamed: 0  S.no  Roll number   Name   ...  Tamil  Maths  \
0             0           0     1           10    Bala  ...     65     89
1             1           1     2           11  Balaji  ...     53     55

   Science  Social  Total
0       69      55    358
1       92      76    374

[2 rows x 11 columns]

In [39]:
print("\n Replace Values \n")
n=pd.read_excel("marksheet EEE.xlsx")
print(n)
y=n.replace({89.0:90})
print(y)
y.to_excel("marksheet EEE.xlsx")

 Replace Values

   Unnamed: 0.2  Unnamed: 0.4  Unnamed: 0.3  Unnamed: 0.1  Unnamed: 0  ...  \
0             0             0             0             0           0  ...
1             1             1             1             1           1  ...
2             2             2             2             2           2  ...
3             3             3             3             3           3  ...
4             4             4             4             4           4  ...
5             5             5             5             5           5  ...
6             6             6             6             6           6  ...
7             7             7             7             7           7  ...
8             8             8             8             8           8  ...
9             9             9             9             9           9  ...

      Name   Maths Science  Social  Total
0      Bala     90      69      55    358
1    Balaji     55      92      76    374
2    Barath     55      94      76    374
3   Bharath     90      94      64    374
4    Bhavan     90      94      64    374
5    Bhavya     56      70      83    374
6   Chandra     56      99      83    374
7  Chelliah     77      99      62    374
8   Deepika     77      94      62    374
9     Diana     59      94      55    374

[10 rows x 12 columns]
   Unnamed: 0.2  Unnamed: 0.4  Unnamed: 0.3  Unnamed: 0.1  Unnamed: 0  ...  \
0             0             0             0             0           0  ...
1             1             1             1             1           1  ...
2             2             2             2             2           2  ...
3             3             3             3             3           3  ...
4             4             4             4             4           4  ...
5             5             5             5             5           5  ...
6             6             6             6             6           6  ...
7             7             7             7             7           7  ...
8             8             8             8             8           8  ...
9             9             9             9             9           9  ...

      Name   Maths Science  Social  Total
0      Bala     90      69      55    358
1    Balaji     55      92      76    374
2    Barath     55      94      76    374
3   Bharath     90      94      64    374
4    Bhavan     90      94      64    374
5    Bhavya     56      70      83    374
6   Chandra     56      99      83    374
7  Chelliah     77      99      62    374
8   Deepika     77      94      62    374
9     Diana     59      94      55    374

[10 rows x 12 columns]

In [42]:
k.drop(['Unnamed: 0.4'],axis=1,inplace=True)
k.drop(['Unnamed: 0.1'],axis=1,inplace=True)
k.drop(['Unnamed: 0'],axis=1,inplace=True)

print(k)
k.to_excel("marksheet EEE.xlsx")

   S.no  Roll number     Name   Maths  Science  Social  Total
0     1           10      Bala     90       69      55    358
1     2           11    Balaji     55       92      76    374
2     3           12    Barath     55       94      76    374
3     4           13   Bharath     90       94      64    374
4     5           14    Bhavan     90       94      64    374
5     6           15    Bhavya     56       70      83    374
6     7           16   Chandra     56       99      83    374
7     8           17  Chelliah     77       99      62    374
8     9           18   Deepika     77       94      62    374
9    10           19     Diana     59       94      55    374

In [46]:
df=pd.read_excel("marksheet EEE.xlsx")
print(df)
print("\n Extract using isin() function \n")
new=df['Science'].isin([94])
print(df[new])

   Unnamed: 0  S.no  Roll number     Name   Maths  Science  Social  Total
0           0     1           10      Bala     90       69      55    358
1           1     2           11    Balaji     55       92      76    374
2           2     3           12    Barath     55       94      76    374
3           3     4           13   Bharath     90       94      64    374
4           4     5           14    Bhavan     90       94      64    374
5           5     6           15    Bhavya     56       70      83    374
6           6     7           16   Chandra     56       99      83    374
7           7     8           17  Chelliah     77       99      62    374
8           8     9           18   Deepika     77       94      62    374
9           9    10           19     Diana     59       94      55    374

 Extract using isin() function

   Unnamed: 0  S.no  Roll number    Name   Maths  Science  Social  Total
2           2     3           12   Barath     55       94      76    374
3           3     4           13  Bharath     90       94      64    374
4           4     5           14   Bhavan     90       94      64    374
8           8     9           18  Deepika     77       94      62    374
9           9    10           19    Diana     59       94      55    374